Repository: moveyourdigital/wp-smtp
Catalog: languages/smtp-*.po
Languages: pt_pt

source: Log all emails sent from WordPress
pt_pt: Regista todos os e-mails enviados a partir do WordPress

source: Email settings
pt_pt: Configurações de e-mail

source: By default, WordPress sends emails without authentication, which can increase the chance of them being marked as spam. To improve deliverability, it is recommended to use an SMTP server.
pt_pt: Por padrão, o WordPress envia emails sem autenticação, o que pode aumentar a chance de eles serem marcados como spam. Para melhorar a entregabilidade, é recomendado usar um servidor SMTP.

source: Send emails using
pt_pt: Enviar emails através de

source: SMTP delivery is enabled.
pt_pt: Envio através de SMTP está ativo.

source: Default unauthenticated method
pt_pt: Método não autenticado por omissão

source: External SMTP server (recommended)
pt_pt: Servidor externo SMTP (recomendado)

source: Server address
pt_pt: Endereço do servidor

source: Port
pt_pt: Porta

source: Authentication
pt_pt: Autenticação

source: Authenticate using username and password
pt_pt: Autenticar com utilizador e password

source: Username
pt_pt: Utilizador

source: Password
pt_pt: Palavra-passe

source: Encryption
pt_pt: Encriptação

source: No encryption layer (insecure)
pt_pt: Nenhuma camada de encriptação (inseguro)

source: Use STARTTLS
pt_pt: Usar STARTTLS

source: Implicit SSL/TLS (recommended)
pt_pt: Usar SSL/TLS implícito (recomendado)

source: The recommended method for securing modern SMTP servers is SSL/TLS, typically using port 465, while explicit STARTTLS commonly uses port 587.
pt_pt: A forma recomendada para manter a segurança de servidores SMTP modernos é através de SSL/TLS, geralmente usando a porta 465, enquanto que no STARTTLS explícito é utilizado na porta 587.

source: From email address
pt_pt: Endereço de e-mail para

source: If left empty, uses the default WordPress email %s which, depending on the server configurations, can decrease the chances of email deliverability.
pt_pt: Se deixado em branco, o WordPress utilizará o email padrão %s, que, dependendo das configurações do servidor, pode diminuir as chances de entrega de emails.
